backend/app/controllers/user_books_controller.rb

    def index
        @userbooks = UserBook.all
---
SELECT "user_books".* FROM "user_books"

    def show
        @userbook = UserBook.find(params[:id])
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]

    def create
        @userbook = UserBook.create(
            user_id: params[:user_id],
            book_id: params[:book_id]
        )
---
INSERT INTO "user_books" ("user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 4], ["book_id", 13], ["created_at", "2020-05-04 22:33:25.346531"], ["updated_at", "2020-05-04 22:33:25.346531"]]

    def destroy_book_join
        book_join = UserBook.find_by(book_id: params[:book_id], user_id: params[:id])
        book_join.destroy
---
SELECT "user_books".* FROM "user_books" WHERE "user_books"."book_id" = ? AND "user_books"."user_id" = ? LIMIT ?  [["book_id", 13], ["user_id", 1], ["LIMIT", 1]]
DELETE FROM "user_books" WHERE "user_books"."id" = ?  [["id", 9]]