backend/app/controllers/users_controller.rb

    def update
        @user = User.find(params[:id])
        @user.update({
            name: params[:name]
        })
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "James Sparrow"], ["updated_at", "2020-05-06 20:12:47.310335"], ["id", 7]]