backend/app/controllers/users_controller.rb

    def create
        @user = User.create(
            name: params[:name]
        )
---
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Lydia"], ["created_at", "2020-05-04 21:48:34.657205"], ["updated_at", "2020-05-04 21:48:34.657205"]]

    def destroy
        @user = User.find(params[:id])
        @user.books.delete_all
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 11]]